RhinoInside.Revit API Documentation
GeometryEncoder.ToCurve Method (ArcCurve)
 Converts the specified Rhino.Geometry.ArcCurve to an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.ArcCurve arcCurve
)
@staticmethod
def ToCurve(
	arcCurve: Rhino.Geometry.ArcCurve
) -> Autodesk.Revit.DB.Curve
Parameters
arcCurve
Type: Rhino.Geometry.ArcCurve
Rhino arcCurve to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino arcCurve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.ArcCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(ArcCurve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = rhinoArcCurve.ToCurve();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_curve = rhino_arccurve.ToCurve()    # type: DB.Curve
 Using ToCurve(ArcCurve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoArcCurve);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_curve = GE.ToCurve(rhino_arccurve)    # type: DB.Curve
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace